"""
Написати функцію,
котра приймає стрічку,
функція повертає даний список,

і за допомогою циклу while


проходиться по даній стрічці,
 добавляючи в список (пустий список створюється в середині функції) всі букви, окрім m та  n
 (всі регістри).

 проте кількість елементів в
ньому має бути не більше 100 одиниць (можете використати len, або створити лічильник
 добавлених букв, або зріз списку (зріз не є найоптимальнішим вибором, оскільки його
  можна застосувати лише після генерації списку, а якщо стрічка буде  мільйон символів,
   то ми в пусту використаємо потужності компютера)
написати тести для даної функції
"""


def foo(string_value: str, exclude: str = 'nNmM') -> list:
    result_list = []
    if not string_value:
        return result_list

    string_value_length = len(string_value)
    position = 0

    while position < string_value_length:
        print(string_value[position])
        if string_value[position] not in exclude:
            result_list.append(string_value[position])
        print(result_list)
        position += 1

    return result_list

foo('mmmsdg')











"""

написати функцію, котра приймає час (в секундах), швидкість (метрів за секунду) та вагу
автомобіля (кг). за допомогою * забезпечити, щоб всі аргументи можна було передати як
keywords аргументи (типу speed=3)

якщо хоч один із аргументів буде менше 0 - рейзимо помилку ValueError, текст помилки -
на ваш вибір (тестувати варіант з рейзом помилки не потрібно)

функція повертає стрічку, наступного змісту: "Транспортний засіб вагою 1000 кг рухався
10 секунд зі швидкістю 3м/сек, і подолав відстань 30 метрів"

написати тести до даної функції

"""
